OdGeEntity2d.isOn(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified point is on this entity, as determined by the tolerance.
\param point [in]  Point to be queried.
\param tol [in]  Geometric tolerance.

OdGeEntity2d.scaleBy(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales this entity by the scale factor about the basepoint, and returns
a reference to this entity.
\param scaleFactor [in]  Scale Factor. The scale factor must be greater than zero.
\param basePoint [in]  Basepoint.

OdGeEntity2d.mirror(OdGeLine2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors this entity about the specified 2D line, and returns
a reference to this entity.
\param line [in]  Mirror Line.

OdGeEntity2d.rotateBy(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Rotates this entity about the specified point by the specified angle, and returns
a reference to this entity.
\param angle [in]  Rotation angle.
\param basePoint [in]  Basepoint.

OdGeEntity2d.translateBy(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 2D translation vector to this entity, and returns
a reference to this entity.
\param translateVec [in]  Translation Vector.

OdGeEntity2d.transformBy(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 2D transformation matrix to this entity, and returns
a reference to this entity.
\param xfm [in]  2D transformation matrix.

OdGeEntity2d.isEqualTo(OdGeEntity2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if the specified entity is equal to this one.
\param other [in]  Entity to be compared
\param tol [in]  Geometric tolerance.
\returns
true if and only if both entities are of the same type, have the same point set within the
specified tolerance, and have the same parameterization.

OdGeEntity2d.op_Inequality(OdGeEntity2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity2d object.
\param entity [in]  Other entity to compare.
\returns
A boolean value that indicates whether the input entity is not identical to this entity.

OdGeEntity2d.op_Equality(OdGeEntity2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity2d object.
\param entity [in]  Other entity to compare.
\returns
A boolean value that indicates whether the input entity is identical to this entity.

OdGeEntity2d.op_Assign(OdGeEntity2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the OdGeEntity2d object.
\param entity [in]  Entity to assign.
\returns
A reference to this OdGeEntity2d object.

OdGeEntity2d.copy
\details
Returns a copy of this entity.
\remarks
The returned object is created with the new operator, and it is the responsibility of the caller to delete it.

OdGeEntity2d.type
\details
Returns the entity type of this entity.

OdGeEntity2d.isKindOf(OdGe.EntityId)
\details
Returns true if and only if this entity is of  type (or is derived from) entType.
\param entType [in]  Entity type to test.

OdGeEntity2d.Dispose
\details
Destructor for the OdGeEntity2d class.